# Question

Youâ€™re given two dataframes. One contains information about addresses and the other contains relationships between various cities and states:

In [22]:
import pandas as pd

addresses = {"address": ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]}
cities = {"city": ["Salt Lake City", "Kansas City", "Detroit", "Tampa", "San Francisco"], 
          "state": ["Utah", "Missouri", "Michigan", "Florida", "California"]}

df_addresses = pd.DataFrame(addresses)

df_cities = pd.DataFrame(cities)

In [23]:
df_addresses

                                       address
0  4860 Sunset Boulevard, San Francisco, 94105
1    3055 Paradise Lane, Salt Lake City, 84103
2              682 Main Street, Detroit, 48204
3        9001 Cascade Road, Kansas City, 64102
4               5853 Leon Street, Tampa, 33605

In [24]:
df_cities

             city       state
0  Salt Lake City        Utah
1     Kansas City    Missouri
2         Detroit    Michigan
3           Tampa     Florida
4   San Francisco  California

In [25]:
df_addresses.columns

Index(['address'], dtype='object')

In [26]:
df_addresses['street'] = 'Null'
df_addresses

                                       address street
0  4860 Sunset Boulevard, San Francisco, 94105   Null
1    3055 Paradise Lane, Salt Lake City, 84103   Null
2              682 Main Street, Detroit, 48204   Null
3        9001 Cascade Road, Kansas City, 64102   Null
4               5853 Leon Street, Tampa, 33605   Null

In [27]:
df_addresses['street'] = df_addresses['address'].apply(lambda x:x.split(',')[0])
df_addresses

                                       address                 street
0  4860 Sunset Boulevard, San Francisco, 94105  4860 Sunset Boulevard
1    3055 Paradise Lane, Salt Lake City, 84103     3055 Paradise Lane
2              682 Main Street, Detroit, 48204        682 Main Street
3        9001 Cascade Road, Kansas City, 64102      9001 Cascade Road
4               5853 Leon Street, Tampa, 33605       5853 Leon Street

In [28]:
df_addresses['city'] = df_addresses['address'].apply(lambda x:x.split(',')[1])
df_addresses

,address,street,city
0,"4860 Sunset Boulevard, San Francisco, 94105",4860 Sunset Boulevard,San Francisco
1,"3055 Paradise Lane, Salt Lake City, 84103",3055 Paradise Lane,Salt Lake City
2,"682 Main Street, Detroit, 48204",682 Main Street,Detroit
3,"9001 Cascade Road, Kansas City, 64102",9001 Cascade Road,Kansas City
4,"5853 Leon Street, Tampa, 33605",5853 Leon Street,Tampa

In [29]:
df_addresses['zipcode'] = df_addresses['address'].apply(lambda x:x.split(',')[2])
df_addresses

,address,street,city,zipcode
0,"4860 Sunset Boulevard, San Francisco, 94105",4860 Sunset Boulevard,San Francisco,94105
1,"3055 Paradise Lane, Salt Lake City, 84103",3055 Paradise Lane,Salt Lake City,84103
2,"682 Main Street, Detroit, 48204",682 Main Street,Detroit,48204
3,"9001 Cascade Road, Kansas City, 64102",9001 Cascade Road,Kansas City,64102
4,"5853 Leon Street, Tampa, 33605",5853 Leon Street,Tampa,33605

In [30]:
df_addresses.drop('address', axis = 1, inplace = True)

In [35]:
df_addresses

                  street             city zipcode
0  4860 Sunset Boulevard    San Francisco   94105
1     3055 Paradise Lane   Salt Lake City   84103
2        682 Main Street          Detroit   48204
3      9001 Cascade Road      Kansas City   64102
4       5853 Leon Street            Tampa   33605

In [36]:
df_cities

             city       state
0  Salt Lake City        Utah
1     Kansas City    Missouri
2         Detroit    Michigan
3           Tampa     Florida
4   San Francisco  California

In [45]:
# df_final = pd.merge(df_addresses,df_cities, on = 'city')
dfinal = df_addresses.merge(df_cities[['city','state']])
df_final

Empty DataFrame
Columns: [street, city, zipcode, state]
Index: []

In [15]:
df_addresses['State']=[df_cities[df_cities['city']==x.strip()]['state'] for x in df_addresses['city']]

In [16]:
df_addresses

,street,city,zipcode,State
0,4860 Sunset Boulevard,San Francisco,94105,"4 California Name: state, dtype: object"
1,3055 Paradise Lane,Salt Lake City,84103,"0 Utah Name: state, dtype: object"
2,682 Main Street,Detroit,48204,"2 Michigan Name: state, dtype: object"
3,9001 Cascade Road,Kansas City,64102,"1 Missouri Name: state, dtype: object"
4,5853 Leon Street,Tampa,33605,"3 Florida Name: state, dtype: object"

In [13]:
full_add = pd.merge(df_addresses, df_cities, on= 'city')
full_add

Empty DataFrame
Columns: [street, city, zipcode, state]
Index: []

In [12]:
full_add = df_addresses.merge(df_cities, left_on = 'city', right_on='city')
full_add

Empty DataFrame
Columns: [street, city, zipcode, state]
Index: []

Write a function to create a single dataframe with complete addresses in the format of street, city, state, zipcode.

In [18]:
import pandas as pd

addresses = {"address": ["4860 Sunset Boulevard, San Francisco, 94105", "3055 Paradise Lane, Salt Lake City, 84103", "682 Main Street, Detroit, 48204", "9001 Cascade Road, Kansas City, 64102", "5853 Leon Street, Tampa, 33605"]}
cities = {"city": ["Salt Lake City", "Kansas City", "Detroit", "Tampa", "San Francisco"], 
          "state": ["Utah", "Missouri", "Michigan", "Florida", "California"]}

df_addresses = pd.DataFrame(addresses)

df_cities = pd.DataFrame(cities)

In [19]:
df_addresses['Street']=[x.split(',')[0] for x in df_addresses['address']] 
df_addresses['City']=[x.split(',')[1] for x in df_addresses['address']] 
df_addresses['Zip']=[x.split(',')[2] for x in df_addresses['address']] 
df_addresses = df_addresses.drop('address',axis=1)

df_addresses['State']=[df_cities[df_cities['city']==x.strip()]['state'] for x in df_addresses['City']]

print(df_addresses)

                  Street             City     Zip  \
0  4860 Sunset Boulevard    San Francisco   94105
1     3055 Paradise Lane   Salt Lake City   84103
2        682 Main Street          Detroit   48204
3      9001 Cascade Road      Kansas City   64102
4       5853 Leon Street            Tampa   33605

                                        State
0  4    California
Name: state, dtype: object
1        0    Utah
Name: state, dtype: object
2    2    Michigan
Name: state, dtype: object
3    1    Missouri
Name: state, dtype: object
4     3    Florida
Name: state, dtype: object

In [ ]:
df_addresses['street'] = df_addresses['address'].apply(lambda x:x.split(',')[0])
df_addresses['city'] = [x.split(',')[1] for x in df_addresses['address']]
df_addresses['zip'] = df_addresses['address'].apply(lambda x:x.split(',')[2])

In [ ]:
df_addresses

In [ ]:
df_addresses = df_addresses.drop('address', axis=1)
df_addresses

In [ ]:
df_cities